tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"
tap "homebrew/services"
tap "jesseduffield/lazygit"
tap "koekeishiya/formulae"
# Cryptography and SSL/TLS Toolkit
brew "openssl"
# Interpreted, interactive, object-oriented programming language
brew "python@3.9"
# C library implementing the SSH2 protocol
brew "libssh2"
# Get a file from an HTTP, HTTPS or FTP server
brew "curl"
brew "curl/openssl"
# Distributed revision control system
brew "git"
# Generate introspection data for GObject libraries
brew "gobject-introspection"
# Image manipulation
brew "netpbm"
# Library to render SVG files using Cairo
brew "librsvg"
# Graph visualization software from AT&T and Bell Labs
brew "graphviz"
# Database of common MIME types
brew "shared-mime-info"
# ISO/IEC 23008-12:2017 HEIF file format decoder and encoder
brew "libheif"
# Simple terminal UI for git commands
brew "lazygit"
# Convert pixel information into colored ASCII art
brew "libcaca"
# X.509 and CMS library
brew "libksba"
# C websockets server library
brew "libwebsockets"
# Install various Ruby versions and implementations
brew "ruby-build"
# Ruby version manager
brew "rbenv"
# Rust toolchain installer
brew "rustup-init"
# Tool to enforce Swift style and conventions
brew "swiftlint"
# User interface to the TELNET protocol
brew "telnet"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Internet file retriever
brew "wget"
# Download YouTube videos from the command-line
brew "youtube-dl"
# Simple hotkey-daemon for macOS.
brew "koekeishiya/formulae/skhd"
# A tiling window manager for macOS based on binary space partitioning.
brew "koekeishiya/formulae/yabai"
# Remove junk and unused files
cask "ccleaner"
# Xcode extension for Github Copilot
cask "copilot-for-xcode"
# Keyboard customizer
cask "karabiner-elements"
# File system integration
cask "macfuse"
# Re-mounts write-protected NTFS volumes
cask "mounty"
# Knowledge base that works on top of a local folder of plain text Markdown files
cask "obsidian"
# QuickLook generator for Markdown files
cask "qlmarkdown"
# QuickLook plugin for JSON files
cask "quicklook-json"
# System monitor for the menu bar
cask "stats"
# Install and switch between multiple versions of Xcode
cask "xcodes"
cask "notunes"
brew "stow"
brew "swiftlint"
cask "karabiner-elements"
brew "lazygit"
brew "nvim"
cask "zed"
brew "npm"
brew "zoxide"
brew "fzf"
