tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"
tap "homebrew/services"
tap "jesseduffield/lazygit"
tap "koekeishiya/formulae"
tap "kylef/formulae"
# Interpreted, interactive, object-oriented programming language
brew "python@3.9"
brew "node"
# Core application library for C
brew "glib"
# Manage compile and link flags for libraries
brew "pkg-config"
# C library implementing the SSH2 protocol
brew "libssh2"
# Libraries to talk to Microsoft SQL Server and Sybase databases
brew "freetds"
# GNU File, Shell, and Text utilities
brew "coreutils"
# Perl lib for reading and writing EXIF metadata
brew "exiftool"
# GNU Transport Layer Security (TLS) Library
brew "gnutls"
# Generate introspection data for GObject libraries
brew "gobject-introspection"
# OpenType text shaping engine
brew "harfbuzz"
# Subtitle renderer for the ASS/SSA subtitle format
brew "libass"
# OCR (Optical Character Recognition) engine
brew "tesseract"
# Play, record, convert, and stream audio and video
brew "ffmpeg"
# Find files with SQL-like queries
brew "fselect"
# Command-line fuzzy finder written in Go
brew "fzf"
# Toolkit for image loading and pixel buffer manipulation
brew "gdk-pixbuf"
# GIF image/animation creator/editor
brew "gifsicle"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Internet file retriever
brew "wget"
# Download YouTube videos from the command-line
brew "youtube-dl"
# Simple hotkey-daemon for macOS.
brew "koekeishiya/formulae/skhd"
# A tiling window manager for macOS based on binary space partitioning.
brew "koekeishiya/formulae/yabai"
# Install and switch between multiple versions of Xcode
cask "xcodes"
# NTFS support
# Re-mounts write-protected NTFS volumes
# Currently fails, figure out why!
# brew "gromgit/fuse/mounty"
# brew "ntfs-3g-mac"
brew "monolith"
cask "copilot-for-xcode"
# Prevent Music app from starting
cask "notunes"
brew "gh"
