tap "helix-editor/helix"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"
tap "homebrew/services"
tap "jesseduffield/lazygit"
tap "koekeishiya/formulae"
tap "kylef/formulae"
tap "lokalise/cli-2"
tap "mono0926/license-plist"
tap "teamookla/speedtest"
tap "vapor/tap"
# Tool for generating GNU Standards-compliant Makefiles
brew "automake"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Platform built on V8 to build network applications
brew "node", link: false
# Package manager for the web
brew "bower"
# Interpreted, interactive, object-oriented programming language
brew "python@3.9"
# Core application library for C
brew "glib"
# Manage compile and link flags for libraries
brew "pkg-config"
# Dependency manager for Cocoa projects
brew "cocoapods", link: false
# C library implementing the SSH2 protocol
brew "libssh2"
# Libraries to talk to Microsoft SQL Server and Sybase databases
brew "freetds"
# General-purpose scripting language
brew "php"
# Dependency Manager for PHP
brew "composer"
# GNU File, Shell, and Text utilities
brew "coreutils"
# Perl lib for reading and writing EXIF metadata
brew "exiftool"
# Easiest way to build and release mobile apps
brew "fastlane"
# GNU Transport Layer Security (TLS) Library
brew "gnutls"
# Generate introspection data for GObject libraries
brew "gobject-introspection"
# OpenType text shaping engine
brew "harfbuzz"
# Subtitle renderer for the ASS/SSA subtitle format
brew "libass"
# OCR (Optical Character Recognition) engine
brew "tesseract"
# Play, record, convert, and stream audio and video
brew "ffmpeg"
# Find files with SQL-like queries
brew "fselect"
# Command-line fuzzy finder written in Go
brew "fzf"
# Toolkit for image loading and pixel buffer manipulation
brew "gdk-pixbuf"
# GitHub command-line tool
brew "gh"
# GIF image/animation creator/editor
brew "gifsicle"
# Distributed revision control system
brew "git"
# Framework for layout and rendering of i18n text
brew "pango"
# Library to render SVG files using Cairo
brew "librsvg"
# Graph visualization software from AT&T and Bell Labs
brew "graphviz"
# Database of common MIME types
brew "shared-mime-info"
# Tools and libraries to manipulate images in many formats
brew "imagemagick"
# Tools and libraries to manipulate images in many formats
brew "imagemagick@6"
# Image loading and rendering library
brew "imlib2"
# Simple terminal UI for git commands
brew "lazygit"
# Convert pixel information into colored ASCII art
brew "libcaca"
# X.509 and CMS library
brew "libksba"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Manage multiple Node.js versions
brew "nvm"
# Cross-platform application and UI framework
brew "qt@5", link: true
# Install various Ruby versions and implementations
brew "ruby-build"
# Ruby version manager
brew "rbenv"
# Powerful, clean, object-oriented scripting language
brew "ruby@2.5"
# Tool to enforce Swift style and conventions
brew "swiftlint"
# User interface to the TELNET protocol
brew "telnet"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Extract, view, and test RAR archives
brew "unrar"
# Command-line tool for Vapor (Server-side Swift web framework)
brew "vapor"
# Vi 'workalike' with many additional features
brew "vim"
# Internet file retriever
brew "wget"
# Drop-in replacement for xcodebuild with a few extra features
brew "xctool"
# Download YouTube videos from the command-line
brew "youtube-dl"
# General-purpose lossless data-compression library
brew "zlib"
# Shell extension to navigate your filesystem faster
brew "zoxide"
# Simple hotkey-daemon for macOS.
brew "koekeishiya/formulae/skhd"
# A tiling window manager for macOS based on binary space partitioning.
brew "koekeishiya/formulae/yabai"
# Lokalise CLI v2
brew "lokalise/cli-2/lokalise2"
# A license list generator of all your dependencies for iOS applications
brew "mono0926/license-plist/license-plist"
# Utility for customizing which browser to start
cask "finicky"
cask "pusher"
# QuickLook generator for Markdown files
cask "qlmarkdown"
cask "quicklook-json"
# Native GUI tool for relational databases
cask "tableplus"
# JDK from the Eclipse Foundation (Adoptium)
cask "temurin"
# Install and switch between multiple versions of Xcode
cask "xcodes"

# Disabled
# Re-mounts write-protected NTFS volumes
# cask "mounty"
# Read-write NTFS driver for FUSE
# brew "ntfs-3g"
